
/* 
 * # message.js 파일 설명
 * -------------------------------------------------------------------------------
 * - 모든 공통 메시지를 이곳에 저장하자.
 * - 나중에 다국어가 필요할 시 이 부분을 변경해서 사용하면 된다.
 * -------------------------------------------------------------------------------
 * 생성자 : 최우진
 * 생성일 : 2015.07.03
 * 
 */


var message = {
							alert: {
										saveComplete:              "저장되었습니다.",
										saveFail:  		            "저장에 실패했습니다.",
										isDelete:                  "삭제하시겠습니까?",
										deleteComplete:            "삭제되었습니다.",
										deleteFail:		            "삭제에 실패했습니다.",
										ajaxFail:                  "호출에 실패했습니다.",
										existsValue:               "이미 존재하는 값입니다.",
										notSelectExcelFile:        "업로드 할 엑셀파일을 선택해 주세요.",
										justOneValue:              "한 개의 값만 필요합니다.",
										existsTodayWords:		 "오늘의 말씀에 이미 존재합니다."
							},
							text: {
										noDoSearch: "아직 검색하지 않았습니다.",
										noExistsSearchResult: "검색결과가 존재하지 않습니다."
							},
							title: {
										add: "등록",
										modify: "수정"
							}
};